Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAR169.atdf
         <register caption="DDR Transfer Configuration Register" name="DDRXFERCFG" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="NXTDATRQDLY" />
            <bitfield mask="0x000000F0" name="NXTDATAVDLY" />
            <bitfield mask="0x000F0000" name="RDATENDLY" />
            <bitfield mask="0x0F000000" name="MAXBURST" />
            <bitfield caption="Big Endian bit" mask="0x80000000" name="BIGENDIAN" values="DDRXFERCFG__BIGENDIAN" />
         </register>
         <register caption="DDR Command Issue Register" name="DDRCMDISSUE" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="NUMHOSTCMDS" />
            <bitfield mask="0x00000010" name="VALID" />
         </register>
         <register caption="DDR On-Die Termination Enable Configuration Register" name="DDRODTENCFG" offset="0x4c" rw="RW" size="4">
            <bitfield caption="On-Die Termination Read Enable bit" mask="0x00000001" name="ODTREN" values="DDRODTENCFG__ODTREN" />
            <bitfield caption="On-Die Termination Write Enable bit" mask="0x00010000" name="ODTWEN" values="DDRODTENCFG__ODTWEN" />
         </register>
         <register caption="DDR Memory Width Register" name="DDRMEMWIDTH" offset="0x50" rw="RW" size="4">
            <bitfield caption="Half-rate Mode bit" mask="0x00000008" name="HALFRATE" values="DDRMEMWIDTH__HALFRATE" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD10" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD11" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD12" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD13" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD14" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD15" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
         <register caption="DDR Host Command 1 Register x (x = 0 through 15)" name="DDRCMD16" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CLKENCMD1" />
            <bitfield mask="0x000001FE" name="CSCMD1" />
            <bitfield mask="0x00000200" name="RASCMD1" />
            <bitfield mask="0x00000400" name="CASCMD1" />
            <bitfield mask="0x00000800" name="WENCMD1" />
            <bitfield mask="0x00001000" name="CLKENCMD2" />
            <bitfield mask="0x001FE000" name="CSCMD2" />
            <bitfield mask="0x00200000" name="RASCMD2" />
            <bitfield mask="0x00400000" name="CASCMD2" />
            <bitfield mask="0x00800000" name="WENCMD2" />
            <bitfield mask="0xFF000000" name="MDALCMD" />
         </register>
